IvanovDmitriy09/Eclipse_templates/Gigadevice/GD32E23x/system/src/cmsis/vectors_gd32e23x.c
/*
 * This file is part of the µOS++ distribution.
 *   (https://github.com/micro-os-plus)
 * Copyright (c) 2014 Liviu Ionescu.
 *
 * Permission is hereby granted, free of charge, to any person
 * obtaining a copy of this software and associated documentation
 * files (the "Software"), to deal in the Software without
 * restriction, including without limitation the rights to use,
 * copy, modify, merge, publish, distribute, sublicense, and/or
 * sell copies of the Software, and to permit persons to whom
 * the Software is furnished to do so, subject to the following
 * conditions:
 *
 * The above copyright notice and this permission notice shall be
 * included in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES
 * OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
 * NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT
 * HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,
 * WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 */

// ----------------------------------------------------------------------------

#include "cortexm/exception-handlers.h"

// ----------------------------------------------------------------------------

void __attribute__((weak))
Default_Handler(void);

// Forward declaration of the specific IRQ handlers. These are aliased
// to the Default_Handler, which is a 'forever' loop. When the application
// defines a handler (with the same name), this will automatically take
// precedence over these weak definitions
//

void __attribute__ ((weak, alias ("Default_Handler")))
WWDGT_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
LVD_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
RTC_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
FMC_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
RCU_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
EXTI0_1_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
EXTI2_3_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
EXTI4_15_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
DMA_Channel0_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
DMA_Channel1_2_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
DMA_Channel3_4_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
ADC_CMP_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TIMER0_BRK_UP_TRG_COM_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TIMER0_Channel_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TIMER2_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TIMER5_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TIMER13_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TIMER14_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TIMER15_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TIMER16_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
I2C0_EV_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
I2C1_EV_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
SPI0_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
SPI1_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
USART0_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
USART1_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
I2C0_ER_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
I2C1_ER_IRQHandler(void);

// ----------------------------------------------------------------------------

extern unsigned int _estack;

typedef void
(* const pHandler)(void);

// ----------------------------------------------------------------------------

// The vector table.
// This relies on the linker script to place at correct location in memory.

__attribute__ ((section(".isr_vector"),used))
pHandler __isr_vectors[] =
  { //
    (pHandler) &_estack,                          // The initial stack pointer
        Reset_Handler,                            // The reset handler

        NMI_Handler,                              // The NMI handler
        HardFault_Handler,                        // The hard fault handler

#if defined(__ARM_ARCH_7M__) || defined(__ARM_ARCH_7EM__)
        MemManage_Handler,                        // The MPU fault handler
        BusFault_Handler,// The bus fault handler
        UsageFault_Handler,// The usage fault handler
#else
        0, 0, 0,				  // Reserved
#endif
        0,                                        // Reserved
        0,                                        // Reserved
        0,                                        // Reserved
        0,                                        // Reserved
        SVC_Handler,                              // SVCall handler
#if defined(__ARM_ARCH_7M__) || defined(__ARM_ARCH_7EM__)
        DebugMon_Handler,                         // Debug monitor handler
#else
        0,					  // Reserved
#endif
        0,                                        // Reserved
        PendSV_Handler,                           // The PendSV handler
        SysTick_Handler,                          // The SysTick handler

        // ----------------------------------------------------------------------
        // gd32e23x vectors
        WWDGT_IRQHandler,                  // Window Watchdog Timer
        LVD_IRQHandler,                    // LVD through EXTI Line detect
        RTC_IRQHandler,                    // RTC through EXTI Line
        FMC_IRQHandler,                    // FMC
        RCU_IRQHandler,                    // RCU
        EXTI0_1_IRQHandler,                // EXTI Line 0 and EXTI Line 1
        EXTI2_3_IRQHandler,                // EXTI Line 2 and EXTI Line 3
        EXTI4_15_IRQHandler,               // EXTI Line 4 to EXTI Line 15
        0,                                 // Reserved
        DMA_Channel0_IRQHandler,           // DMA Channel 0
        DMA_Channel1_2_IRQHandler,         // DMA Channel 1 and DMA Channel 2
        DMA_Channel3_4_IRQHandler,         // DMA Channel 3 and DMA Channel 4
        ADC_CMP_IRQHandler,                // ADC and Comparator
        TIMER0_BRK_UP_TRG_COM_IRQHandler,  // TIMER0 Break,Update,Trigger and Commutation
        TIMER0_Channel_IRQHandler,         // TIMER0 Channel Capture Compare
        0,                                 // Reserved
        TIMER2_IRQHandler,                 // TIMER2
        TIMER5_IRQHandler,                 // TIMER5
        0,                                 // Reserved
        TIMER13_IRQHandler,                // TIMER13
        TIMER14_IRQHandler,                // TIMER14
        TIMER15_IRQHandler,                // TIMER15
        TIMER16_IRQHandler,                // TIMER16
        I2C0_EV_IRQHandler,                // I2C0 Event
        I2C1_EV_IRQHandler,                // I2C1 Event
        SPI0_IRQHandler,                   // SPI0
        SPI1_IRQHandler,                   // SPI1
        USART0_IRQHandler,                 // USART0
        USART1_IRQHandler,                 // USART1
        0,                                 // Reserved
        0,                                 // Reserved
        0,                                 // Reserved
        I2C0_ER_IRQHandler,                // I2C0 Error
        0,                                 // Reserved
        I2C1_ER_IRQHandler,                // I2C1 Error
    };

// ----------------------------------------------------------------------------

// Processor ends up here if an unexpected interrupt occurs or a specific
// handler is not present in the application code.

void __attribute__ ((section(".after_vectors")))
Default_Handler(void)
{
  while (1)
    {
	  ;
    }
}

// ----------------------------------------------------------------------------
